# Taps
tap "sdkman/tap"

# CLI Tools
brew "git"
brew "gh"
brew "jq"
brew "pyenv"
brew "nvm"
brew "fzf"
brew "bat"
brew "sdkman-cli"

# Browsers & Productivity
cask "brave-browser"
cask "obsidian"
cask "notion"
cask "todoist"
cask "spotify"   
cask "bitwarden"
cask "google-drive" 

# Dev Tools & Terminals
cask "visual-studio-code"
cask "warp"
cask "github"      
cask "bruno"        
cask "docker"     
cask "ollama"

# Security & Utilities
cask "protonvpn"
cask "rectangle"
