# Taps
tap "sdkman/tap"
tap "google/antigravity"


# CLI Tools
brew "git"
brew "gh"
brew "jq"
brew "pyenv"
brew "nvm"
brew "fzf"
brew "bat"
brew "sdkman-cli"
brew "lazygit"
brew "ncdu"
brew "btop"

# Browsers & Productivity
cask "brave-browser"
cask "obsidian"
cask "notion"
cask "todoist"
cask "spotify"   
cask "bitwarden"
cask "google-drive" 
cask "figma"
cask "numi"

# Dev Tools & Terminals
cask "visual-studio-code"
cask "warp"
cask "github"      
cask "bruno"        
cask "docker"     
cask "ollama"
cask "claude"
cask "figma"
cask "beekeeper-studio"
cask "antigravity"

# Security & Utilities
cask "protonvpn"
cask "rectangle"

# Misc
cask "adobe-creative-cloud"
cask "davinci-resolve"